{
  "candidates": [
    {
      "rank": 1,
      "name": "United Premium Foods",
      "website": "https://unitedpremiumfoods.com",
      "location": "New Jersey, USA",
      "type": "Human-grade fresh pet food co-manufacturer",
      "ideal_stage": "Pilot → scale",
      "description": "Full-service USDA and FDA-inspected co-packer specializing in AAFCO-compliant human-grade fresh premium pet foods; offers R&D, ingredient sourcing, cooking, blending, and packaging from small to high-volume runs.[web:393]",
      "fit_notes": [
        "Already manufactures fresh human-grade dog food to AAFCO standards, so they understand vet-grade requirements and QA.[web:393]",
        "Service offering explicitly includes custom formulation and private-label manufacturing, which maps well to Dogology’s model-driven, proprietary recipes.[web:393]",
        "East Coast location with established logistics network for regional/national cold-chain distribution."
      ],
      "risks": [
        "Likely to have MOQs and slotting constraints; will need strong projected volume or premium positioning.",
        "You’ll need to validate willingness to do true 'kit' SKUs (separate pouches for meats, veg, oils) vs single finished chubs."
      ]
    },
    {
      "rank": 2,
      "name": "Karn Meats",
      "website": "https://www.karnmeats.com",
      "location": "Ohio, USA",
      "type": "USDA human-grade pet food and fully cooked meat co-packer",
      "ideal_stage": "Pilot → regional scale",
      "description": "USDA and FDA-inspected, SQF-certified facility that offers co-manufacturing of human-grade, gently cooked pet food products using real meat, fruits, and vegetables.[web:392]",
      "fit_notes": [
        "Markets specifically as a 'human grade pet food' supplier with custom product development and co-packing, including cooked and frozen formats.[web:392]",
        "Likely comfortable running multiple SKUs and doing portioned packs, which aligns with multi-component kit assembly.",
        "Midwestern location can be advantageous for sourcing beef/poultry and central distribution."
      ],
      "risks": [
        "Smaller than some national brands; capacity for very large volumes would need to be confirmed.",
        "You’ll have to design the kit assembly flow (multiple components per box) on top of their core cooked-food processes."
      ]
    },
    {
      "rank": 3,
      "name": "JustFoodForDogs – Master Kitchens (Strategic Partner)",
      "website": "https://www.justfoodfordogs.com",
      "location": "CA & DE master kitchens",
      "type": "Fresh dog food brand with large USDA kitchens",
      "ideal_stage": "Strategic partnership after concept validation",
      "description": "Operates large 'master kitchens' producing human-grade fresh dog food; Delaware kitchen alone built for ~30,000 lb/day and supports national expansion.[web:397][web:401]",
      "fit_notes": [
        "Deep veterinary nutrition focus and published data about using whole-food recipes and DIY nutrient blends.[web:377][web:383]",
        "Existing infrastructure for sourcing, cooking, batch testing, and cold-chain distribution at scale.[web:397][web:401]",
        "Conceptually close to your DIY-plus-premix idea; a white-label or co-developed 'Dogology HealthSpan Kit' line is plausible."
      ],
      "risks": [
        "They are a branded competitor; may resist white-label manufacturing unless there is a compelling joint value prop.",
        "Governance/IP boundaries around your MER model and their recipe IP would need careful structuring."
      ]
    },
    {
      "rank": 4,
      "name": "Freshpet",
      "website": "https://www.freshpet.com",
      "location": "Multiple US facilities",
      "type": "Branded human-grade refrigerated pet food manufacturer",
      "ideal_stage": "Long-term strategic co-dev",
      "description": "Large-scale producer of refrigerated fresh pet food with SQF-certified kitchens, APHIS/FDA registration, and robust food-safety and sourcing standards.[web:402]",
      "fit_notes": [
        "Serious QA and safety infrastructure; strong at chilled, high-throughput production and distribution to national retail.[web:402]",
        "Their focus on freshness and minimally processed food aligns with your 'cook at home' narrative."
      ],
      "risks": [
        "Heavily retail- and brand-focused; less obvious that they’ll entertain custom kit co-manufacturing for a startup.",
        "Process and line design are optimized for finished rolls/chubs, not multi-component meal kits."
      ]
    },
    {
      "rank": 5,
      "name": "Raised Right (or similar boutique human-grade brands)",
      "website": "https://www.raisedrightpets.com",
      "location": "USA (brand, co-manufacturing specifics need inquiry)",
      "type": "Boutique human-grade fresh pet food brand",
      "ideal_stage": "Very early pilot / regional proof-of-concept",
      "description": "Smaller human-grade fresh pet food companies that emphasize traceable sourcing, batch testing, and transparency; good cultural fit for a high-trust, data-rich kit concept.[web:394][web:399]",
      "fit_notes": [
        "Strong alignment on 'radical transparency' and human-grade positioning.[web:394][web:399]",
        "Potential flexibility to experiment with kit-style SKUs and joint storytelling around provenance and data."
      ],
      "risks": [
        "Limited capacity and higher unit costs; better suited for small-batch pilots than for national scale.",
        "Manufacturing might already be with a third-party co-packer you’d need to work through."
      ]
    }
  ]
}
